website/src/pages/docs/handlers/soap.mdx

---
description:
  Generate executable schema for SOAP services with GraphQL Mesh SOAP handler. Consume WSDL files
  and get started easily.
---

# SOAP

![image](https://user-images.githubusercontent.com/20847995/79220083-0a1d3a00-7e5c-11ea-9ac5-855428121143.png)

This handler allows you to consume [SOAP](https://soapui.org) `WSDL` files and generate a remote
executable schema for those services.

To get started, install the handler library:

```sh npm2yarn
npm i @graphql-mesh/soap
```

Now, you can use it directly in your Mesh config file:

```yaml filename=".meshrc.yaml" {4-5}
sources:
  - name: CountryInfo
    handler:
      soap:
        source: http://webservices.oorsprong.org/websamples.countryinfo/CountryInfoService.wso?WSDL
```

## Headers

If you want to add SOAP headers to the request body like below:

```xml
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:header="http://foo.com/">
   <soap:Header>
      <header:MyHeader>
         <header:UserName>user</header:UserName>
         <header:Password>password</header:Password>
      </header:MyHeader>
   </soap:Header>
```

You can add the headers to the configuration like below:

```yaml
sources:
  - name: CountryInfo
    handler:
      soap:
        source: ...
        soapHeaders:
          namespace: http://foo.com
          headers:
            MyHeader:
              UserName: user
              Password: password
```

When the WSDL defines a `soap:header` binding that references a typed message element, you can
omit `namespace` and `alias` — the loader will auto-detect them from the WSDL:

```yaml
sources:
  - name: MyService
    handler:
      soap:
        source: ...
        soapHeaders:
          headers:
            UserName: myuser
            Password: mypass
```

### soap:header vs soap:body arguments

Operations whose WSDL binding marks certain message parts as `soap:header` have those parts
excluded from the generated GraphQL field arguments. Only `soap:body` parts appear as arguments,
keeping the GraphQL schema clean and matching the actual wire format.

## Multi-namespace WSDLs

When a WSDL imports XSD schemas that live in a different XML namespace from the WSDL
`targetNamespace`, Mesh automatically resolves the correct namespace for each element and field.

For example, if a WSDL declares `targetNamespace="http://example.com/service"` but the body
element type is defined in `http://example.com/types`, the generated request XML will use the
correct namespace prefix:

```xml
<soap:Envelope xmlns:soap="..." xmlns:ns2="http://example.com/types">
  <soap:Body>
    <ns2:GetData>
      <ns2:Id>123</ns2:Id>
    </ns2:GetData>
  </soap:Body>
</soap:Envelope>
```

No extra configuration is needed — the loader reads the `xmlns` declarations from the WSDL and
propagates them through the `@soap` directive so the executor can use the right prefix for every
element.

## Body Alias

You can now choose the name of the alias you want to use for SOAP body;

```yaml filename=".meshrc.yaml" {4}
sources:
  - name: CountryInfo
    handler:
      soap:
        source: ...
        bodyAlias: my-body
```

Then it will generate a body like below by using the alias;

```xml
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:my-body="http://foo.com/">
   <soap:Body>
      <my-body:Foo>
          <my-body:Bar>baz</my-body:Bar>
      </my-body:Foo>
   </soap:Body>
</soap:Envelope>
```

## Custom SOAP namespace

By default, Mesh detects the namespace from the WSDL file. If you want to use a custom namespace
based on SOAP version.

For SOAP 1.1, it is set to `http://schemas.xmlsoap.org/soap/envelope/` and for SOAP 1.2, it is set
to `http://www.w3.org/2003/05/soap-envelope`.

If you want to use a custom namespace, you can set it like below;

```yaml
sources:
  - name: CountryInfo
    handler:
      soap:
        source: ...
        soapNamespace: http://foo.com/schemas/soap/envelope
```

## CodeSandBox Example

You can check out our example that uses SOAP Handler.

<iframe
  src="https://codesandbox.io/embed/github/ardatan/graphql-mesh/tree/master/examples/soap-country-info?fontsize=14&hidenavigation=1&theme=dark&module=%2F.meshrc.yml"
  className="mt-6 w-full h-[500px] rounded-md"
  title="country-info-example"
  allow="geolocation; microphone; camera; midi; vr; accelerometer; gyroscope; payment; ambient-light-sensor; encrypted-media; usb"
  sandbox="allow-modals allow-forms allow-popups allow-scripts allow-same-origin"
/>

## Config API Reference

import API from '../../../generated-markdown/SoapHandler.generated.md'

<API />
